<?php

use yii\db\Migration;

/**
 * Handles the creation of table `subcategories`.
 */
class m180901_194925_create_subcategories_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $tableOptions = 'CHARACTER SET utf8 COLLATE utf8_general_ci ENGINE=InnoDB';

        $this->createTable('{{%subcategories}}', [
            'id'          => $this->primaryKey(),
            'old_id'      => $this->integer()->notNull()->unique(),
            'old_cat_id'  => $this->integer()->notNull(),
            'cat_id'      => $this->integer()->notNull(),
            'subcat_name' => $this->string(100)->notNull(),
            'sort'        => $this->integer()->notNull(),
        ], $tableOptions);
        $this->batchInsert('{{%subcategories}}', [
            'old_id',
            'old_cat_id',
            'cat_id',
            'subcat_name',
            'sort'
        ], [
            [3, 2, 2, 'Запчасти', 6],
	        [4, 2, 2, 'Легковые автомобили', 1],
	        [17, 2, 2, 'Грузовые автомобили', 2],
	        [18, 2, 2, 'Коммерческий транспорт', 3],
	        [19, 2, 2, 'Мото и велотранспорт', 4],
	        [20, 2, 2, 'Водный транспорт', 5],
	        [21, 2, 2, 'Прочее', 7],
	        [5, 1, 1, 'Квартиры', 1],
	        [6, 1, 1, 'Комнаты', 2],
	        [7, 1, 1, 'Дома и коттеджи', 3],
	        [8, 1, 1, 'Участки и дачи', 5],
	        [9, 1, 1, 'Гаражи', 6],
	        [10, 1, 1, 'Прочее', 7],
	        [11, 1, 1, 'Коммерческая недвижимость', 4],
	        [23, 22, 3, 'Мебель, интерьер', 1],
	        [24, 22, 3, 'Одежда и обувь', 4],
	        [25, 22, 3, 'Товары для детей', 5],
	        [30, 22, 3, 'Прочее', 13],
	        [59, 22, 3, 'Бытовая техника', 2],
	        [60, 22, 3, 'Телевизоры', 3],
	        [62, 22, 3, 'Продукты питания', 11],
	        [63, 22, 3, 'Здоровье и красота', 12],
	        [39, 38, 5, 'Телефоны и аксессуары', 4],
	        [43, 38, 5, 'Компьютеры и комплектующие', 3],
	        [44, 38, 5, 'Игровые приставки', 7],
	        [45, 38, 5, 'Офисная техника', 5],
	        [46, 38, 5, 'Прочее', 9],
	        [64, 38, 5, 'Аудио и видео', 2],
	        [65, 38, 5, 'Фото и оптика', 6],
	        [66, 38, 5, 'Приборы и радиодетали', 8],
	        [53, 50, 7, 'Поиск сотрудников', 1],
	        [54, 50, 7, 'Поиск работы', 2],
	        [73, 50, 7, 'Обучение, образование', 3],
	        [74, 50, 7, 'Другое', 4],
	        [67, 58, 12, 'Промышленное оборудование', 2],
	        [68, 58, 12, 'Торговое и холодильное оборудование', 3],
	        [69, 58, 12, 'Строительное оборудование', 4],
	        [71, 58, 12, 'Другое', 6],
	        [72, 58, 12, 'Станочное оборудование', 5],
	        [75, 47, 6, 'Ремонтные', 2],
	        [76, 47, 6, 'Фото и видеосъемка', 3],
	        [77, 47, 6, 'Юридические', 4],
	        [78, 47, 6, 'Бухгалтерские', 5],
	        [79, 47, 6, 'Бытовые услуги', 6],
	        [80, 47, 6, 'Репетиторство', 7],
	        [52, 47, 6, 'Транспортные', 1],
	        [81, 47, 6, 'Другое', 8],
	        [82, 31, 4, 'Книги, учебники, журналы', 3],
	        [83, 31, 4, 'Все для хобби', 4],
	        [84, 31, 4, 'Все для музыки', 5],
	        [85, 31, 4, 'Животные и растения', 6],
	        [86, 31, 4, 'Охота и рыбалка', 1],
	        [87, 31, 4, 'Спорт и туризм', 2],
	        [88, 31, 4, 'Другое', 7],
	        [89, 55, 9, 'Стройматериалы', 1],
	        [90, 55, 9, 'Инструменты', 2],
	        [91, 55, 9, 'Электрика', 3],
	        [92, 55, 9, 'Срубы, бани и пр.', 4],
	        [93, 55, 9, 'Сантехника', 5],
	        [94, 55, 9, 'Другое', 6],
	        [95, 57, 11, 'Садовая техника и инвентарь', 1],
	        [96, 57, 11, 'Все для садоводства', 2],
	        [97, 57, 11, 'Мангалы и грили', 3],
	        [98, 57, 11, 'Другое', 4],
	        [99, 51, 8, 'Обращения', 1],
	        [100, 51, 8, 'Отдых, общение', 2],
	        [101, 51, 8, 'Знакомства', 3],
	        [102, 56, 10, 'Отдам даром', 1],
	        [103, 56, 10, 'Приму в дар', 2],
        ]);

        $this->addForeignKey('fk-adverts-subcat_id', '{{%adverts}}', 'subcat_id', '{{%subcategories}}', 'id');
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropForeignKey('fk-adverts-subcat_id', '{{%adverts}}');
        $this->dropTable('{{%subcategories}}');
    }
}
